isc-fs/stm32-can-bootloader/Core/Src/bl_proto.c
    uint32_t sectors = 0U;
    bl_log_info("FLASH_ERASE start=0x%08X len=0x%X",
                (unsigned int)start, (unsigned int)length);
    bl_flash_status_t st = bl_flash_erase(start, length, &sectors);
    if (st != BL_FLASH_OK) {
        if (st == BL_FLASH_ERR_HARDWARE) {
            bl_dtc_log(BL_DTC_FLASH_HW, BL_DTC_SEV_ERROR, start);
            bl_log_error("FLASH_ERASE hw fail at 0x%08X", (unsigned int)start);
        } else {
            bl_log_warn("FLASH_ERASE rejected (status=%d)", (int)st);
        }
        send_nack(peer, BL_CMD_FLASH_ERASE, flash_status_to_nack(st));
        return;
    }
    bl_log_info("FLASH_ERASE ok (%u sectors)", (unsigned int)sectors);

    uint8_t resp[1] = { BL_CMD_FLASH_ERASE };
    send_ack(peer, resp, (uint16_t)sizeof(resp));
}

/* CMD_FLASH_WRITE: [addr_le32, data...]. Programs `args_len - 4` bytes
 * starting at `addr`. `addr` must be FLASHWORD-aligned; trailing
 * partial FLASHWORD is padded with 0xFF. Requires an active session. */
static void handle_flash_write(uint8_t peer, const uint8_t *args, uint16_t args_len)
{
    if (!g_session_active) {
        send_nack(peer, BL_CMD_FLASH_WRITE, BL_NACK_BAD_SESSION);
        return;
    }
    if (args_len < 5U) {
        /* Need at least the address plus one data byte. */
        send_nack(peer, BL_CMD_FLASH_WRITE, BL_NACK_UNSUPPORTED);
        return;
    }

    uint32_t addr = read_le32(&args[0]);
    const uint8_t *data = &args[4];
    uint16_t       data_len = (uint16_t)(args_len - 4U);
    bl_live_note_flash_addr(addr);

    bl_flash_status_t st = bl_flash_write(addr, data, data_len);
    if (st != BL_FLASH_OK) {
        if (st == BL_FLASH_ERR_HARDWARE) {
            bl_dtc_log(BL_DTC_FLASH_HW, BL_DTC_SEV_ERROR, addr);
        }
        send_nack(peer, BL_CMD_FLASH_WRITE, flash_status_to_nack(st));
        return;
    }

    uint8_t resp[1] = { BL_CMD_FLASH_WRITE };
    send_ack(peer, resp, (uint16_t)sizeof(resp));
}

/* CMD_FLASH_READ_CRC: [addr_le32, length_le32]. Returns CRC32 over the
 * range. Read-only but still gated behind the session — "any FLASH_*
 * requires CONNECT" is a cleaner invariant. */
static void handle_flash_read_crc(uint8_t peer, const uint8_t *args, uint16_t args_len)
{
    if (!g_session_active) {
        send_nack(peer, BL_CMD_FLASH_READ_CRC, BL_NACK_BAD_SESSION);
        return;
    }
    if (args_len < 8U) {
        send_nack(peer, BL_CMD_FLASH_READ_CRC, BL_NACK_UNSUPPORTED);
        return;
    }

    uint32_t addr   = read_le32(&args[0]);
    uint32_t length = read_le32(&args[4]);

    /* CRC is read-only but we still enforce the writable range — a host
     * CRC'ing the bootloader itself would be a protocol abuse. */
    if (!bl_flash_range_is_writable(addr, length)) {
        send_nack(peer, BL_CMD_FLASH_READ_CRC, BL_NACK_OUT_OF_BOUNDS);
        return;
    }

    uint32_t crc = bl_flash_crc32(addr, length);

    uint8_t resp[5] = {
        BL_CMD_FLASH_READ_CRC,
        (uint8_t)(crc        & 0xFFU),
        (uint8_t)((crc >>  8) & 0xFFU),
        (uint8_t)((crc >> 16) & 0xFFU),
        (uint8_t)((crc >> 24) & 0xFFU),
    };
    send_ack(peer, resp, (uint16_t)sizeof(resp));
}

/* CMD_FLASH_VERIFY: [expected_crc_le32, expected_size_le32,
 *                    expected_version_le32]. Recomputes CRC32 over
 * [BL_APP_BASE, BL_APP_BASE + expected_size). On match, stamps the
 * application metadata FLASHWORD so next boot will auto-jump. */
static void handle_flash_verify(uint8_t peer, const uint8_t *args, uint16_t args_len)
{
    if (!g_session_active) {
        send_nack(peer, BL_CMD_FLASH_VERIFY, BL_NACK_BAD_SESSION);
        return;
    }
    if (args_len < 12U) {
        send_nack(peer, BL_CMD_FLASH_VERIFY, BL_NACK_UNSUPPORTED);
        return;
    }

    uint32_t expected_crc     = read_le32(&args[0]);
    uint32_t expected_size    = read_le32(&args[4]);
    uint32_t expected_version = read_le32(&args[8]);

    if (expected_size == 0U || expected_size > BL_APP_SIZE) {
        send_nack(peer, BL_CMD_FLASH_VERIFY, BL_NACK_OUT_OF_BOUNDS);
        return;
    }

    uint32_t computed = bl_flash_crc32(BL_APP_BASE, expected_size);
    if (computed != expected_crc) {
        send_nack(peer, BL_CMD_FLASH_VERIFY, BL_NACK_CRC_MISMATCH);
        return;
    }

    bl_flash_status_t st = bl_flash_write_metadata(expected_size,
                                                    expected_crc,
                                                    expected_version);
    if (st != BL_FLASH_OK) {
        if (st == BL_FLASH_ERR_HARDWARE) {
            bl_dtc_log(BL_DTC_FLASH_HW, BL_DTC_SEV_ERROR, BL_APP_METADATA_ADDR);
        }
        send_nack(peer, BL_CMD_FLASH_VERIFY, flash_status_to_nack(st));
        return;
    }

    uint8_t resp[1] = { BL_CMD_FLASH_VERIFY };
    send_ack(peer, resp, (uint16_t)sizeof(resp));
}

/* CMD_JUMP: [addr_le32]. Phase-2 policy: the address must equal
 * BL_APP_BASE, and the installed app must pass the integrity check.
 * Host tools with a use for jumping elsewhere will land that in a
 * later phase. */
static void handle_jump(uint8_t peer, const uint8_t *args, uint16_t args_len)
{
    if (args_len < 4U) {
        send_nack(peer, BL_CMD_JUMP, BL_NACK_UNSUPPORTED);
        return;
    }

    uint32_t addr = (uint32_t)args[0]
                  | ((uint32_t)args[1] << 8)
                  | ((uint32_t)args[2] << 16)
                  | ((uint32_t)args[3] << 24);

    if (addr != BL_APP_BASE) {
        send_nack(peer, BL_CMD_JUMP, BL_NACK_OUT_OF_BOUNDS);
        return;
    }

    if (Bootloader_CheckApplication() != 0U) {
        send_nack(peer, BL_CMD_JUMP, BL_NACK_NO_VALID_APP);
        return;
    }

    uint8_t resp[1] = { BL_CMD_JUMP };
    send_ack(peer, resp, (uint16_t)sizeof(resp));

    /* Let the ACK drain onto the wire before we deinit peripherals. */
    HAL_Delay(10U);
    Bootloader_JumpToApplication();  /* never returns on success */
}

/* CMD_OB_READ: no args. Returns a 16-byte bl_ob_status_t snapshot. Not
 * session-gated — hosts need to be able to probe the current WRP mask
 * before opening a session so the provisioning UI can decide whether
 * OB_APPLY_WRP is needed. ACK payload is 17 bytes (opcode + record) →
 * one FF + two CFs over ISO-TP. */
static void handle_ob_read(uint8_t peer)
{
    bl_ob_status_t status;
    if (bl_obyte_read(&status) != BL_OB_OK) {
        send_nack(peer, BL_CMD_OB_READ, BL_NACK_FLASH_HW);
        return;
    }

    uint8_t resp[1U + BL_OB_STATUS_SIZE];
    resp[0] = BL_CMD_OB_READ;
    memcpy(&resp[1], &status, BL_OB_STATUS_SIZE);
    send_ack(peer, resp, (uint16_t)sizeof(resp));
}

/* CMD_OB_APPLY_WRP: [token_le32, sector_bitmap_le32?]. Session-gated.
 *
 * This is a destructive, non-reversible operation on recent H7 silicon
 * (WRP is cleared only by a full chip erase via external debugger) so
 * the handler insists on the 4-byte BL_OB_APPLY_TOKEN confirmation
 * prefix. A stray frame without the token earns NACK(OB_WRONG_TOKEN),
 * never causes an accidental brick.
 *
 * The sector bitmap is optional. When omitted, the default is 0x01 —
 * protect the bootloader's own sector only, which is the common case
 * during provisioning. Bit N maps to sector N (H7x3 single-bank, 8
 * sectors).
 *
 * On success bl_obyte_apply_wrp calls HAL_FLASH_OB_Launch which resets
 * the MCU and never returns. The ACK is sent first with a short drain
 * delay; if the launch ever does return (documented edge case) we emit
 * NACK(FLASH_HW) so the host isn't left waiting. */
static void handle_ob_apply_wrp(uint8_t peer, const uint8_t *args, uint16_t args_len)
{
    if (!g_session_active) {
        send_nack(peer, BL_CMD_OB_APPLY_WRP, BL_NACK_BAD_SESSION);
        return;
    }
    if (args_len < 4U) {
        send_nack(peer, BL_CMD_OB_APPLY_WRP, BL_NACK_OB_WRONG_TOKEN);
        return;
    }

