isc-fs/stm32-can-bootloader/Core/Src/bl_proto.c
    uint32_t token = read_le32(&args[0]);
    if (token != BL_OB_APPLY_TOKEN) {
        bl_log_warn("OB_APPLY_WRP bad token 0x%08X", (unsigned int)token);
        send_nack(peer, BL_CMD_OB_APPLY_WRP, BL_NACK_OB_WRONG_TOKEN);
        return;
    }

    uint32_t sector_bitmap = 0x01U;  /* default: protect bootloader sector */
    if (args_len >= 8U) {
        sector_bitmap = read_le32(&args[4]);
    }

    bl_log_warn("OB_APPLY_WRP committing mask=0x%08X (reset imminent)",
                (unsigned int)sector_bitmap);

    uint8_t resp[1] = { BL_CMD_OB_APPLY_WRP };
    send_ack(peer, resp, (uint16_t)sizeof(resp));

    /* Drain the ACK before HAL_FLASH_OB_Launch yanks the MCU. */
    HAL_Delay(10U);

    bl_ob_rc_t rc = bl_obyte_apply_wrp(sector_bitmap);
    /* Only reachable if OB_Launch didn't reset — HAL flagged a program
     * failure. The session is gone either way; flag it to the host. */
    bl_dtc_log(BL_DTC_FLASH_HW, BL_DTC_SEV_ERROR, (uint32_t)rc);
    bl_log_error("OB_APPLY_WRP HAL failure rc=%d", (int)rc);
    send_nack(peer, BL_CMD_OB_APPLY_WRP, BL_NACK_FLASH_HW);
}

/* Dispatch a completed ISO-TP message. byte 0 = opcode, remaining bytes
 * = opcode-specific args. Anything unknown earns NACK(UNSUPPORTED). */
static void handle_message(uint8_t peer,
                           uint8_t opcode,
                           const uint8_t *args,
                           uint16_t args_len)
{
    bl_live_note_opcode(opcode);

    switch (opcode) {
        case BL_CMD_CONNECT:
            handle_connect(peer, args, args_len);
            break;
        case BL_CMD_DISCONNECT:
            handle_disconnect(peer, args_len);
            break;
        case BL_CMD_DISCOVER:
            handle_discover(peer);
            break;
        case BL_CMD_GET_FW_INFO:
            handle_get_fw_info(peer);
            break;
        case BL_CMD_GET_HEALTH:
            handle_get_health(peer);
            break;
        case BL_CMD_FLASH_ERASE:
            handle_flash_erase(peer, args, args_len);
            break;
        case BL_CMD_FLASH_WRITE:
            handle_flash_write(peer, args, args_len);
            break;
        case BL_CMD_FLASH_READ_CRC:
            handle_flash_read_crc(peer, args, args_len);
            break;
        case BL_CMD_FLASH_VERIFY:
            handle_flash_verify(peer, args, args_len);
            break;
        case BL_CMD_LOG_STREAM_START:
            handle_log_stream_start(peer, args, args_len);
            break;
        case BL_CMD_LOG_STREAM_STOP:
            handle_log_stream_stop(peer);
            break;
        case BL_CMD_LIVE_DATA_START:
            handle_live_data_start(peer, args, args_len);
            break;
        case BL_CMD_LIVE_DATA_STOP:
            handle_live_data_stop(peer);
            break;
        case BL_CMD_DTC_READ:
            handle_dtc_read(peer);
            break;
        case BL_CMD_DTC_CLEAR:
            handle_dtc_clear(peer);
            break;
        case BL_CMD_NVM_READ:
            handle_nvm_read(peer, args, args_len);
            break;
        case BL_CMD_NVM_WRITE:
            handle_nvm_write(peer, args, args_len);
            break;
        case BL_CMD_OB_READ:
            handle_ob_read(peer);
            break;
        case BL_CMD_OB_APPLY_WRP:
            handle_ob_apply_wrp(peer, args, args_len);
            break;
        case BL_CMD_RESET:
            handle_reset(peer, args, args_len);
            break;
        case BL_CMD_JUMP:
            handle_jump(peer, args, args_len);
            break;
        default:
            send_nack(peer, opcode, BL_NACK_UNSUPPORTED);
            break;
    }
}

/* ---- Public API ---- */

void bl_proto_dispatch(const bl_proto_id_t *id,
                       const uint8_t *data,
                       uint8_t length)
{
    if (!bl_proto_addressed_to_us(id->dst) || length == 0U) {
        return;
    }

    /* Accepted TYPE/PCI combinations:
     *   - CMD      + SF / FF : host command (single or multi-frame)
     *   - DISCOVER + SF / FF : broadcast identity request
     *   - DATA     + CF / FC : continuation / flow control
     * Everything else is silently dropped. */
    uint8_t pci_hi = data[0] & BL_ISOTP_PCI_MASK_HI;
    bool initial = (id->type == BL_PROTO_TYPE_CMD || id->type == BL_PROTO_TYPE_DISCOVER)
                 && (pci_hi == BL_ISOTP_PCI_SF || pci_hi == BL_ISOTP_PCI_FF);
    bool continuation = (id->type == BL_PROTO_TYPE_DATA)
                     && (pci_hi == BL_ISOTP_PCI_CF || pci_hi == BL_ISOTP_PCI_FC);
    if (!initial && !continuation) {
        return;
    }

    /* Any frame that made it through the TYPE/PCI gate counts as session
     * activity — including frames that end up getting NACKed. A host
     * that's still transmitting, even unsuccessfully, is still alive. */
    session_touch_activity();
    bl_live_frame_rx();

    bool                 send_fc = false;
    bl_isotp_rx_status_t st      = bl_isotp_rx_feed(&g_rx,
                                                     (uint8_t)id->type,
                                                     id->src,
                                                     data,
                                                     length,
                                                     &send_fc);

    if (send_fc) {
        /* Arm the reassembly deadline at the same instant we tell the
         * host it may proceed with CFs. */
        g_rx.deadline_ms = HAL_GetTick() + BL_ISOTP_TIMEOUT_MS;
        send_fc_cts(id->src);
    }

    switch (st) {
        case BL_ISOTP_MSG_COMPLETE:
            if (g_rx.received >= 1U) {
                handle_message(id->src,
                               g_rx.buf[0],
                               &g_rx.buf[1],
                               (uint16_t)(g_rx.received - 1U));
            } else {
                send_nack(id->src, 0xFFU, BL_NACK_TRANSPORT_ERROR);
            }
            bl_isotp_rx_init(&g_rx);
            break;

        case BL_ISOTP_OK:
            break;

