isc-fs/stm32-can-bootloader/Core/Src/bl_proto.c
        case BL_ISOTP_ERR_TIMEOUT:
            /* Only _tick returns this; _feed never does. Handle
             * defensively anyway. */
            send_nack(id->src, 0xFFU, BL_NACK_TRANSPORT_TIMEOUT);
            bl_isotp_rx_init(&g_rx);
            break;

        default:
            send_nack(id->src, 0xFFU, BL_NACK_TRANSPORT_ERROR);
            bl_isotp_rx_init(&g_rx);
            break;
    }
}

void bl_proto_tick(uint32_t now_ms)
{
    uint8_t peer = 0U;
    if (bl_isotp_rx_tick(&g_rx, now_ms, &peer)) {
        send_nack(peer, 0xFFU, BL_NACK_TRANSPORT_TIMEOUT);
    }

    /* Session watchdog — only runs while a session is active. Unsigned
     * subtraction wraps around the 32-bit HAL_GetTick roll-over
     * correctly: it measures elapsed milliseconds since the last
     * activity, not an absolute deadline. */
    if (g_session_active) {
        uint32_t elapsed = now_ms - g_session_last_activity_ms;
        if (elapsed >= BL_SESSION_TIMEOUT_MS) {
            session_timeout();
        }
    }
}

bool bl_proto_session_active(void)
{
    return g_session_active;
}

void bl_proto_send_notify(const uint8_t *payload, uint16_t length)
{
    /* NOTIFY always goes to the host (node 0x0). Unsolicited — does
     * not refresh the session watchdog. */
    send_message(BL_PROTO_TYPE_NOTIFY, BL_PROTO_NODE_HOST, payload, length);
}

uint32_t bl_proto_session_age_ms(uint32_t now_ms)
{
    if (!g_session_active) {
        return 0U;
    }
    return now_ms - g_session_last_activity_ms;
}

uint16_t bl_proto_isotp_rx_progress(void)
{
    return (g_rx.state == BL_ISOTP_STATE_WAIT_CF) ? (uint16_t)g_rx.received : 0U;
}
